/*---------------------------------------------------------------------------*
  Project:  NitroSDK - MB - include
  File:     mb.h

  Copyright 2003-2006 Nintendo.  All rights reserved.

  These coded instructions, statements, and computer programs contain
  proprietary information of Nintendo of America Inc. and/or Nintendo
  Company Ltd., and are protected by Federal copyright law.  They may
  not be disclosed to third parties or copied or duplicated in any form,
  in whole or in part, without the prior written consent of Nintendo.

  $Log: mb.h,v $
  Revision 1.13  2006/01/18 02:11:29  kitase_hirotake
  do-indent

  Revision 1.12  2005/08/17 01:13:34  yosizaki
  add MB_GetMultiBootDownloadParameter().

  Revision 1.11  2005/05/20 03:11:07  yosizaki
  add MBGameRegistry::userParam.

  Revision 1.10  2005/04/11 03:37:16  yosizaki
  fix comment.

  Revision 1.9  2005/04/11 01:46:10  yosizaki
  add MB_SetLifeTime().
  add MB_SetPowerSaveMode().

  Revision 1.8  2005/03/14 07:09:33  sato_masaki
  MB_GetGameEntryBitmap()関数を追加。

  Revision 1.7  2005/03/01 01:57:00  yosizaki
  copyright の年を修正.

  Revision 1.6  2005/02/28 05:26:24  yosizaki
  do-indent.

  Revision 1.5  2004/11/24 05:14:43  yosizaki
  rename MB_StartParentEx/MB_EndEx..

  Revision 1.4  2004/11/22 12:58:17  takano_makoto
  コメント追加

  Revision 1.3  2004/11/18 07:34:05  takano_makoto
  MB_SetParentCommSize, MB_SetParentCommParamで子機送信サイズの設定引数を廃止

  Revision 1.2  2004/11/11 11:54:44  yosizaki

/* ---------------------------------------------------------------------

        定数

   ---------------------------------------------------------------------*/

#define MB_MAX_CHILD                    WM_NUM_MAX_CHILD

/* ファイル名の文字数 */
#define MB_FILENAME_SIZE_MAX            (10)

/* 親機のファイル最大数 */
#define MB_MAX_FILE                     (16)

/* マルチブートワークのサイズ */
#define MB_SYSTEM_BUF_SIZE              (0xC000)

/* 親機の通信サイズの設定可能範囲 */
#define MB_COMM_PARENT_SEND_MIN         256
#define MB_COMM_PARENT_SEND_MAX         510

#define MB_COMM_PARENT_RECV_MIN         8
#define MB_COMM_PARENT_RECV_MAX         16

/* MB_ReadSegment() に必要なバッファサイズの最小値 */
#define MB_SEGMENT_BUFFER_MIN           0x10000

/* MB API 結果型 */
#define MB_SUCCESS                      MB_ERRCODE_SUCCESS      // 旧互換

/* MB_Init() に対して TGID を自動で設定するよう指定する定義値 */
#define	MB_TGID_AUTO	0x10000

/*
 * マルチブート用親機ゲーム情報
 */

#define MB_ICON_COLOR_NUM               16      // アイコン色数
#define MB_ICON_PALETTE_SIZE            (MB_ICON_COLOR_NUM * 2) // アイコンデータサイズ (16bitカラー×色数)
#define MB_ICON_DATA_SIZE               512     // アイコンデータサイズ (32×32dot 16色)
#define MB_GAME_NAME_LENGTH             48      // ゲームネーム長       (2byte単位)         ※最大で左記文字数でかつ、横幅185ドット以内に収まる範囲で指定。
#define MB_GAME_INTRO_LENGTH            96      // ゲーム説明長         (2byte単位)         ※最大で左記文字数でかつ、横幅199ドット×2に収まる範囲で指定。
#define MB_USER_NAME_LENGTH             10      // ユーザーネーム長     (2byte単位)
#define MB_MEMBER_MAX_NUM               15      // 通信メンバー最大数
#define MB_FILE_NO_MAX_NUM              64      // MbGameInfo.fileNoはビーコンに乗せる時に6bitになるので、最大は64個
#define MB_GAME_INFO_RECV_LIST_NUM      16      // 子機側でのゲーム情報受信リスト個数

/* ブートタイプ */
#define MB_TYPE_ILLEGAL                 0       /* 不正な状態 */
#define MB_TYPE_NORMAL                  1       /* ROM から起動 */
#define MB_TYPE_MULTIBOOT               2       /* マルチブート子機 */

#define MB_BSSDESC_SIZE                 (sizeof(MBParentBssDesc))
#define MB_DOWNLOAD_PARAMETER_SIZE      HW_DOWNLOAD_PARAMETER_SIZE

/* 親機ダウンロードの状態 */
typedef enum
{
    MB_COMM_PSTATE_NONE,
    MB_COMM_PSTATE_INIT_COMPLETE,
    MB_COMM_PSTATE_CONNECTED,
    MB_COMM_PSTATE_DISCONNECTED,
    MB_COMM_PSTATE_KICKED,
    MB_COMM_PSTATE_REQ_ACCEPTED,
    MB_COMM_PSTATE_SEND_PROCEED,
    MB_COMM_PSTATE_SEND_COMPLETE,
    MB_COMM_PSTATE_BOOT_REQUEST,
    MB_COMM_PSTATE_BOOT_STARTABLE,
    MB_COMM_PSTATE_REQUESTED,
    MB_COMM_PSTATE_MEMBER_FULL,
    MB_COMM_PSTATE_END,
    MB_COMM_PSTATE_ERROR,
    MB_COMM_PSTATE_WAIT_TO_SEND,

    /*  内部使用の列挙値です。
       この値の状態には遷移しません。 */
    MB_COMM_PSTATE_WM_EVENT = 0x80000000
}
MBCommPState;


/* 子機からの接続リクエストに対する応答 */
typedef enum
{
    MB_COMM_RESPONSE_REQUEST_KICK,     /* 子機からのエントリー要求を拒否する． */
    MB_COMM_RESPONSE_REQUEST_ACCEPT,   /* 子機からのエントリー要求を受け入れる． */
    MB_COMM_RESPONSE_REQUEST_DOWNLOAD, /* 子機へダウンロード開始を通知する． */
    MB_COMM_RESPONSE_REQUEST_BOOT      /* 子機へブート開始を通知する． */
}
MBCommResponseRequestType;


/*  親機イベント通知コールバック型 */
typedef void (*MBCommPStateCallback) (u16 child_aid, u32 status, void *arg);


typedef struct
{
    u16     errcode;
}
MBErrorStatus;

typedef enum
{
    /* 成功を示す値 */
    MB_ERRCODE_SUCCESS = 0,

    MB_ERRCODE_INVALID_PARAM,          /* 引数エラー */
    MB_ERRCODE_INVALID_STATE,          /* 呼び出し状態の条件不整合 */

    /* 以下のエラーは子機専用． */
    MB_ERRCODE_INVALID_DLFILEINFO,     /* ダウンロード情報が不正 */
    MB_ERRCODE_INVALID_BLOCK_NO,       /* 受信したブロック番号が不正 */
    MB_ERRCODE_INVALID_BLOCK_NUM,      /* 受信ファイルのブロック数が不正 */
    MB_ERRCODE_INVALID_FILE,           /* 要求していないファイルのブロックを受信した */
    MB_ERRCODE_INVALID_RECV_ADDR,      /* 受信アドレスが不正 */

    /* 以下のエラーはWMのエラーに起因． */
    MB_ERRCODE_WM_FAILURE,             /* WM のコールバックにおけるエラー */

    /** 以降は通信継続不可なもの (WM の再初期化が必要) **/
    MB_ERRCODE_FATAL,

    MB_ERRCODE_MAX
}
MBErrCode;

/* ---------------------------------------------------------------------

        構造体

   ---------------------------------------------------------------------*/

/*
 * マルチブートゲーム登録情報構造体.
 */
typedef struct
{
    /* プログラムバイナリのファイルパス */
    const char *romFilePathp;
    /* ゲーム名の文字列を指すポインタ */
    u16    *gameNamep;
    /* ゲーム内容の説明文文字列を指すポインタ */
    u16    *gameIntroductionp;
    /* アイコンキャラデータのファイルパス */
    const char *iconCharPathp;
    /* アイコンパレットデータのファイルパス */
    const char *iconPalettePathp;
    /* ゲームグループID */
    u32     ggid;
    /* 最大プレイ人数 */
    u8      maxPlayerNum;
    u8      pad[3];
    /* ユーザ定義の拡張パラメータ (32BYTE) */
    u8      userParam[MB_DOWNLOAD_PARAMETER_SIZE];
}
MBGameRegistry;


/*
 * アイコンデータ構造体.
 * アイコンは 16色パレット + 32dot * 32dot.
 */
typedef struct
{
    /* パレットデータ (32 BYTE) */
    u16     palette[MB_ICON_COLOR_NUM];
    u16     data[MB_ICON_DATA_SIZE / 2];
    /* キャラクタデータ (512 BUYTE) */
}
MBIconInfo;                            /* 544byte */


/*
 * ユーザー情報構造体.
 */
typedef struct
{
    /* 好きな色データ (色セット番号) */
    u8      favoriteColor:4;
    /* プレイヤー番号（親機はNo.0、子機はNo.1-15） */
    u8      playerNo:4;
    /* ニックネーム長 */
    u8      nameLength;
    /* ニックネーム */
    u16     name[MB_USER_NAME_LENGTH];
}
MBUserInfo;                            /* 22byte */


/*
 * マルチブート親機情報.
 * (WMbssDescからgameInfo[128]を除いたもの)
 */
typedef struct
{
    u16     length;                    // 2
    u16     rssi;                      // 4
    u16     bssid[3];                  // 10
    u16     ssidLength;                // 12
    u8      ssid[32];                  // 44
    u16     capaInfo;                  // 46
    struct
    {
        u16     basic;                 // 48
        u16     support;               // 50
    }
    rateSet;
    u16     beaconPeriod;              // 52
    u16     dtimPeriod;                // 54
    u16     channel;                   // 56
    u16     cfpPeriod;                 // 58
    u16     cfpMaxDuration;            // 60
}
MBParentBssDesc;


/* マルチブート子機にとっての親機情報を保持する構造体 */
typedef struct
{
    u16     boot_type;
    MBParentBssDesc parent_bss_desc;
}
MBParam;


/* 子機からのエントリーリクエスト時に受信するデータ型 */
typedef struct
{
    u32     ggid;                      //  4B
    MBUserInfo userinfo;               // 22B
    u16     version;                   //  2B
    u8      fileid;                    //  1B
    u8      pad[3];                    // 計 29B
}
MBCommRequestData;


/* ---------------------------------------------------------------------

        マルチブートライブラリ(MB)API - 親機用

   ---------------------------------------------------------------------*/

/*---------------------------------------------------------------------------*
  Name:         MB_Init

  Description:  MB ライブラリ初期化

  Arguments:    work   - MBの内部状態管理のために割り当てるメモリへのポインタ
                         このサイズは MB_SYSTEM_BUF_SIZE バイト以上である必要
                         があります。また、動的確保を行う場合、
                         MB_GetParentSystemBufSize関数にて、サイズを取得することも
                         できます。
                         割り当てたメモリはMB_End関数を呼ぶまで内部で使用され
                         ます。

                user   - ユーザデータが格納された構造体のポインタ
                         このポインタが指す内容はMB_Init関数の中でのみ参照され
                         ます。

                ggid   - GGIDを指定します。

