//==============================================================================
/**
 * @file	ending.h
 * @brief	エンディング メイン制御のヘッダ
 * @author	matsuda
 * @date	2008.04.07(月)
 */
//==============================================================================
#ifndef __ENDING_H__
#define __ENDING_H__

//==============================================================================
//	構造体定義
//==============================================================================
//--------------------------------------------------------------
/**
 *	エンディング用ParentWork
 */
//--------------------------------------------------------------
typedef struct {
	int					playerSex;	///< プレイヤー性別
	BOOL				clearFlag;	///< 一度でもエンディングを見たことがあるか？
	const ZUKAN_WORK*	zukanWork;	///< 図鑑ワークポインタ(プラチナでは未使用)
}ENDING_PARENT_PARAM;


//==============================================================================
//	外部関数宣言
//==============================================================================
extern PROC_RESULT EndingProc_Init( PROC * proc, int * seq );
extern PROC_RESULT EndingProc_Main( PROC * proc, int * seq );
extern PROC_RESULT EndingProc_End( PROC * proc, int * seq );


#endif	//__ENDING_H__
