//[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[
/**
 *	GAME FREAK inc.
 *
 *	@file		worldtimer_place.h
 *	@brief		世界時計	世界時間取得
 *	@author		tomoya takahashi
 *	@data		2007.12.18
 *
 */
//]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]
#ifndef __WORLDTIMER_PLACE_H__
#define __WORLDTIMER_PLACE_H__


#include "wflby_def.h"


#include "msgdata/msg_wifi_place_msg_world.h"
#include "msgdata/msg_wifi_place_msg_GBR.h"

//-----------------------------------------------------------------------------
/**
 *					定数宣言
*/
//-----------------------------------------------------------------------------


//-------------------------------------
///	世界時計の基準値　国コードと地域コード
//=====================================
#define WLDTIMER_GMT_NATIONID	(country219)
#define WLDTIMER_GMT_AREAID		(GBR03)

//-----------------------------------------------------------------------------
/**
 *					構造体宣言
*/
//-----------------------------------------------------------------------------
//-----------------------------------------------------------------------------
//	src/application/wifi_earth/wifi_earthからコピー
//-----------------------------------------------------------------------------
//データ設定構造体（国バイナリデータ）
typedef struct EARTH_DATA_NATION_tag
{
	u16 flag;
	s16 x;
	s16 y;
}EARTH_DATA_NATION;

//データ設定構造体（地域バイナリデータ）
typedef struct EARTH_DATA_AREA_tag
{
	s16 x;
	s16 y;
}EARTH_DATA_AREA;
//-----------------------------------------------------------------------------

//-----------------------------------------------------------------------------
/**
 *					プロトタイプ宣言
*/
//-----------------------------------------------------------------------------
// 地域の時間を取得する
extern WFLBY_TIME WFLBY_WORLDTIMER_PLACE_GetPlaceTime( u16 nation, u8 area, WFLBY_TIME gmt, u32 heapID );


#endif		// __WORLDTIMER_PLACE_H__

