//==============================================================================
/**
 * @file	gds_types.h
 * @brief	GDSの通信関連の定義ファイル
 * @author	matsuda
 * @date	2007.12.11(火)
 */
//==============================================================================
#ifndef __GDS_TYPES_H__
#define __GDS_TYPES_H__


//==============================================================================
//	定数定義
//==============================================================================
///ボックスショットの受信件数
#define GDS_BOXSHOT_RECIEVE_NUM			(20)

///ドレスアップショットの受信件数
#define GDS_DRESSUP_RECIEVE_NUM			(5)


#endif	//__GDS_TYPES_H__

