//==============================================================================
/**
 * @file	br_sys_def.h
 * @brief	バトルレコーダー
 * @author	matsuda
 * @date	2008.01.18(金)
 *
 * アセンブラファイルからもincludeされて問題ないものだけ定義
 *
 */
//==============================================================================
#ifndef __BR_SYS_DEF_H__
#define __BR_SYS_DEF_H__

//==============================================================================
//	定数定義
//==============================================================================
// -------------------------------------
//
//	モード
//
// -------------------------------------
#define BR_MODE_BROWSE		( 0 )		///< ブラウザ
#define BR_MODE_GDS			( 1 )		///< GDS
#define BR_MODE_GDS_BV		( 2 )		///< GDSバトルビデオ
#define BR_MODE_GDS_BV_RANK	( 3 )		///< GDSバトルビデオランキング
#define BR_MODE_GDS_RANK	( 4 )		///< GDSトレーナーランキング
#define BR_MODE_GDS_DRESS	( 5 )		///< GDSドレスアップショット
#define BR_MODE_GDS_BOX		( 6 )		///< GDSボックスショット

#define BR_MODE_MAX			( BR_MODE_GDS_BOX + 1 )



#endif	//__BR_SYS_DEF_H__
