//==============================================================================================
/**
 * @file	frontier_monitor.h
 * @brief	「バトルファクトリー」モニター
 * @author	Satoshi Nohara
 * @date	2007.04.24
 */
//==============================================================================================
#ifndef _FRONTIER_MONITOR_H_
#define _FRONTIER_MONITOR_H_

#include "system/window.h"


//==============================================================================================
//
//	定義
//
//==============================================================================================


//==============================================================================================
//
//	構造体
//
//==============================================================================================
typedef struct{
	SAVEDATA* sv;
	u8	type;							//シングル、ダブル、マルチ、WIFI
	u8	fr_no;							//施設ナンバー
	u16 monsno;							//モンスターナンバー
}FRONTIER_MONITOR_CALL;


//==============================================================================================
//
//	extern宣言
//
//==============================================================================================
//extern const PROC_DATA FrontierProcData;				//プロセス定義データ
extern PROC_RESULT FrontierMonitorProc_Init( PROC * proc, int * seq );
extern PROC_RESULT FrontierMonitorProc_Main( PROC * proc, int * seq );
extern PROC_RESULT FrontierMonitorProc_End( PROC * proc, int * seq );


#endif //_FRONTIER_MONITOR_H_


