//==============================================================================================
/**
 * @file	stage.h
 * @brief	「バトルステージ」ヘッダー
 * @author	Satoshi Nohara
 * @date	2007.06.07
 */
//==============================================================================================
#ifndef _STAGE_H_
#define _STAGE_H_

#include "../../src/frontier/stage_def.h"


//==============================================================================================
//
//	定義
//
//==============================================================================================


//==============================================================================================
//
//	ステージ画面呼び出し　構造体宣言
//
//==============================================================================================
typedef struct{
	SAVEDATA* sv;

	u8	type; 
	u8	csr_pos;									//選択画面のカーソル位置
	u16 ret_work;									//戻り値格納ワーク

	u8* p_rank;										//ランクデータのポインタ(0-9,10)
	POKEPARTY* p_party;
	void* p_work;									//STAGE_SCRWORK(bf_scr_wk保存)
	u16* p_pair_poke_level;							//相手のポケモンのレベル

	u16	btl_count;									//今何戦目か

	u32 dummy_work;
}STAGE_CALL_WORK;


//==============================================================================================
//
//	extern宣言
//
//==============================================================================================
//extern const PROC_DATA StageProcData;				//プロセス定義データ
extern PROC_RESULT StageProc_Init( PROC * proc, int * seq );
extern PROC_RESULT StageProc_Main( PROC * proc, int * seq );
extern PROC_RESULT StageProc_End( PROC * proc, int * seq );


#endif //_STAGE_H_


