//==============================================================================================
/**
 * @file	roulette_bmp.h
 * @brief	「バトルルーレット」BMP
 * @author	Satoshi Nohara
 * @date	08.09.05
 */
//==============================================================================================
#ifndef _ROULETTE_BMP_H_
#define _ROULETTE_BMP_H_

#include "roulette_sys.h"
#include "system/window.h"


//==============================================================================================
//
//	ランクアップ　データ
//
//==============================================================================================
//ビットマップID
enum{
	RANK_BMPWIN_TALK = 0,
	RANK_BMPWIN_YESNO,
	ROULETTE_BMPWIN_MAX,			//BMPウィンドウの数
};


//==============================================================================================
//
//	extern宣言
//
//==============================================================================================

//--------------------------------------------------------------
/**
 * @brief	ビットマップ追加
 *
 * @param	ini		BGLデータ
 * @param	win		ビットマップウィンドウ
 *
 * @return	none
 */
//--------------------------------------------------------------
extern void RouletteAddBmpWin( GF_BGL_INI* bgl, GF_BGL_BMPWIN* win );

//--------------------------------------------------------------
/**
 * @brief	ビットマップウィンドウ破棄	
 *
 * @param	win		ビットマップウィンドウ
 *
 * @return	none
 */
//--------------------------------------------------------------
extern void RouletteExitBmpWin( GF_BGL_BMPWIN* win );

//--------------------------------------------------------------
/**
 * @brief	ビットマップウィンドウオフ
 *
 * @param	win		ビットマップウィンドウ
 *
 * @return	none
 */
//--------------------------------------------------------------
extern void RouletteOffBmpWin( GF_BGL_BMPWIN* win );

//--------------------------------------------------------------
/**
 * @brief	メニューウィンドウ表示
 *
 * @param	ini		BGLデータ
 * @param	win		ビットマップウィンドウ
 *
 * @return	none
 */
//--------------------------------------------------------------
extern void RouletteWriteMenuWin( GF_BGL_INI* bgl, GF_BGL_BMPWIN* win );

//--------------------------------------------------------------------------------------------
/**
 * 会話ウィンドウ表示
 *
 * @param	win		BMPデータ
 * @param	wintype	ウィンドウタイプ
 *
 * @return	none
 */
//--------------------------------------------------------------------------------------------
extern void RouletteTalkWinPut( GF_BGL_BMPWIN * win, WINTYPE wintype );


#endif //_ROULETTE_BMP_H_


