//==============================================================================================
/**
 * @file	factory_bmp.h
 * @brief	「バトルファクトリー」BMP
 * @author	Satoshi Nohara
 * @date	2007.03.15
 */
//==============================================================================================
#ifndef _FACTORY_BMP_H_
#define _FACTORY_BMP_H_

#include "factory_sys.h"
#include "system/window.h"


//==============================================================================================
//
//	定義
//
//==============================================================================================
//ビットマップID
enum{
	BMPWIN_TR1 = 0,
	BMPWIN_TR2,
	BMPWIN_POKE1,
	BMPWIN_POKE2,
	BMPWIN_POKE3,
	BMPWIN_TALK,
	BMPWIN_YESNO,
	BMPWIN_SEL,
	BMPWIN_POKE4,
	BMPWIN_POKE5,
	FACTORY_BMPWIN_MAX,				//BMPウィンドウの数
};


//==============================================================================================
//
//	extern宣言
//
//==============================================================================================

//--------------------------------------------------------------
/**
 * @brief	ビットマップ追加
 *
 * @param	ini		BGLデータ
 * @param	win		ビットマップウィンドウ
 *
 * @return	none
 */
//--------------------------------------------------------------
extern void FactoryAddBmpWin( GF_BGL_INI* bgl, GF_BGL_BMPWIN* win );

//--------------------------------------------------------------
/**
 * @brief	ビットマップウィンドウ破棄	
 *
 * @param	win		ビットマップウィンドウ
 *
 * @return	none
 */
//--------------------------------------------------------------
extern void FactoryExitBmpWin( GF_BGL_BMPWIN* win );

//--------------------------------------------------------------
/**
 * @brief	ビットマップウィンドウオフ
 *
 * @param	win		ビットマップウィンドウ
 *
 * @return	none
 */
//--------------------------------------------------------------
extern void FactoryOffBmpWin( GF_BGL_BMPWIN* win );

//--------------------------------------------------------------
/**
 * @brief	メニューウィンドウ表示
 *
 * @param	ini		BGLデータ
 * @param	win		ビットマップウィンドウ
 *
 * @return	none
 */
//--------------------------------------------------------------
extern void FactoryWriteMenuWin( GF_BGL_INI* bgl, GF_BGL_BMPWIN* win );

//--------------------------------------------------------------------------------------------
/**
 * 会話ウィンドウ表示
 *
 * @param	win		BMPデータ
 * @param	wintype	ウィンドウタイプ
 *
 * @return	none
 */
//--------------------------------------------------------------------------------------------
extern void FactoryTalkWinPut( GF_BGL_BMPWIN * win, WINTYPE wintype );


#endif //_FACTORY_BMP_H_


