//==============================================================================================
/**
 * @file	stage_savedata_local.h
 * @brief	「バトルステージ」ヘッダー
 * @author	Satoshi Nohara
 * @date	2007.06.07
 */
//==============================================================================================
#ifndef	__STAGE_SAVEDATA_LOCAL_H__
#define	__STAGE_SAVEDATA_LOCAL_H__

#include "..\frontier\stage_def.h"

//============================================================================================
//
//	プレイデータ
//
//============================================================================================
struct _STAGEDATA{
	u8	type		:3;										//シングル、ダブル、マルチ、wifiマルチ
	u8	save_flag	:1;										//セーブ済みかどうかフラグ
	u8	dmy99		:4;
	u8	round;												//今何人目？

	//参加している手持ちポケモンの位置情報
	u8 mine_poke_pos[STAGE_ENTRY_POKE_MAX];

	//敵トレーナーデータ
	u16 tr_index[STAGE_LAP_MULTI_ENEMY_MAX];				//トレーナーindexテーブル[18*2]

	//敵ポケモンデータが被らないように保存
	u16 enemy_poke_index[STAGE_LAP_MULTI_ENEMY_MAX];		//ポケモンindexテーブル
};


//============================================================================================
//
//	成績データ
//
//============================================================================================
struct _STAGESCORE{
	u8	clear_flag;											//7連勝(クリア)したかフラグ(ビット)
	u8	dmy;
	u16 dummy;

	//タイプごとのレベル(ランク)
	//u8 type_level[STAGE_TYPE_MAX][STAGE_TR_TYPE_MAX/2];	//[4][18/2] 4bit
};


#endif	__STAGE_SAVEDATA_LOCAL_H__


