//==============================================================================
/**
 * @file	balloon_tcb_pri.h
 * @brief	風船割りのTCBプライオリティ定義
 * @author	matsuda
 * @date	2007.11.07(水)
 */
//==============================================================================
#ifndef __BALLOON_TCB_PRI_H__
#define __BALLOON_TCB_PRI_H__


///FightUpdate(アクターUpdate等実行している)	メインループの最後で実行
#define TCBPRI_BALLOON_UPDATE		(60000)


//--------------------------------------------------------------
//	サブ画面
//--------------------------------------------------------------



#endif	//__BALLOON_TCB_PRI_H__

