/*---------------------------------------------------------------------------*
  Project:  NitroSDK - WM - include
  File:     wm.h

  Copyright 2003-2007 Nintendo.  All rights reserved.

  These coded instructions, statements, and computer programs contain
  proprietary information of Nintendo of America Inc. and/or Nintendo
  Company Ltd., and are protected by Federal copyright law.  They may
  not be disclosed to third parties or copied or duplicated in any form,
  in whole or in part, without the prior written consent of Nintendo.

  $Log: wm.h,v $
  Revision 1.172  2007/11/09 13:08:09  seiki_masashi
  電波の受信のみ可能な状態に無線を初期化する関数を追加

  Revision 1.171  2007/05/02 08:42:57  seiki_masashi
  WM_StartMPEx 関数での追加設定パラメータの影響が一時的になるよう変更

  Revision 1.170  2007/02/20 00:28:08  kitase_hirotake
  indent source

  Revision 1.169  2006/07/06 12:53:18  seiki_masashi
  WMGameInfo 構造体に platform を追加し、ver を 2 へ変更

  Revision 1.168  2006/07/06 11:46:30  okubata_ryoma
  undo

  Revision 1.166  2006/02/20 06:47:38  seiki_masashi
  WM_GAMEINFO_LENGTH_MIN の追加

  Revision 1.165  2006/02/20 02:24:45  seiki_masashi
  WMGameInfo.version を廃止し、magicNumber と ver を追加
  WMGameInfo.gameNameCount_attribute を attribute に名前変更
  WM_GAMEINFO_TYPE_OLD のサポートを廃止

  Revision 1.164  2006/01/18 02:12:39  kitase_hirotake
  do-indent

  Revision 1.163  2005/12/01 15:06:09  seiki_masashi
  WMPortSend/RecvCallback 構造体に maxSend/RecvDataSize フィールドを追加
  WMStartParent/ConenctCallback 構造体に parent/childSize フィールドを追加


// MP 通信中には設定できないパラメータのリスト
#define WM_MP_PARAM_MUST_SET_BEFORE_MP      (WM_MP_PARAM_MIN_POLL_BMP_MODE|WM_MP_PARAM_SINGLE_PACKET_MODE|WM_MP_PARAM_IGNORE_SIZE_PRECHECK_MODE)

// WMMPTmpParam.mask 用定数
#define WM_MP_TMP_PARAM_MIN_FREQUENCY              0x0001
#define WM_MP_TMP_PARAM_FREQUENCY                  0x0002
#define WM_MP_TMP_PARAM_MAX_FREQUENCY              0x0004
#define WM_MP_TMP_PARAM_DEFAULT_RETRY_COUNT        0x0200
#define WM_MP_TMP_PARAM_MIN_POLL_BMP_MODE          0x0400
#define WM_MP_TMP_PARAM_SINGLE_PACKET_MODE         0x0800
#define WM_MP_TMP_PARAM_IGNORE_FATAL_ERROR_MODE    0x1000

// パラメータの限界値
#define WM_MP_PARAM_INTERVAL_MAX 10000 // interval に設定可能な値は 10000us 以下

// miscFlags 用定数
#define WM_MISC_FLAG_LISTEN_ONLY               0x0001
#define WM_MISC_FLAG_NO_BLINK                  0x0002

// WM APIのコールバックの型
typedef void (*WMcallbackFunc) (void *arg);     // WM APIのコールバック型
typedef void (*WMCallbackFunc) (void *arg);     // WM APIのコールバック型

// バッファサイズ =======================================================================

//┌──────────┐
//│ WM9 variable       │ 512
//├──────────┤
//│ WM7 variable       │ 256 + 512
//├──────────┤
//│ WM status          │ 2048
//├──────────┤
//│ FIFO buf (9 → 7)  │ 256
//├──────────┤
//│ FIFO buf (9 ← 7)  │ 256
//└──────────┘

// WMで使用するバッファのサイズ -------------------

#define WM_ARM9WM_BUF_SIZE      512    // ARM9側WMの変数領域のサイズ
#define WM_ARM7WM_BUF_SIZE      ( 256 + 512 )   // ARM7側WMの変数領域のサイズ
#define WM_STATUS_BUF_SIZE      2048   // WMのステータス領域のサイズ
#define WM_FIFO_BUF_SIZE        256    // ARM9,7間のFIFOコマンドバッファサイズ

// ユーザーが確保するバッファのサイズ -------------
//   WMシステムで使用する全バッファのサイズ 512 + 256 + 512 + 2048 + 256 + 256 = 0xf00 (FIFO_BIF * 2 であることに注意)
#define WM_SYSTEM_BUF_SIZE      (WM_ARM9WM_BUF_SIZE + WM_ARM7WM_BUF_SIZE + WM_STATUS_BUF_SIZE + WM_FIFO_BUF_SIZE + WM_FIFO_BUF_SIZE)
#define WM_BSS_DESC_SIZE        192    // WM_StartScan()で引き渡す、親機情報格納用バッファのサイズ

#define WM_DCF_MAX_SIZE         1508   // DCFで受信できる最大サイズ
#define WM_KEYSET_SIZE          36     // KeySetのサイズ
#define WM_KEYDATA_SIZE         2      // KeyDataのサイズ

#define WM_DS_HEADER_SIZE       4

#ifdef WM_DS_DATA_SIZE_252             // WM_DS_DATA_SIZE == 252 で構わない場合
#define WM_DS_DATA_SIZE         252
#else  // WM_DS_DATA_SIZE == 508 の場合（デフォルト）
#define WM_DS_DATA_SIZE         508    // 1つの WMDataSet の最大データサイズ(512-4)
                                       // WM_DS_DATA_SIZE+WM_DS_HEADER_SIZE が 32 の倍数の必要有
#endif

#define WM_DS_DATASET_NUM       4      // WMDataSetBuf にいくつの WMDataSet を保持するか(固定値)
#define WM_DS_INFO_SIZE         (sizeof(WMDataSharingInfo))     // DataSharing用バッファサイズ

#define WM_SCAN_EX_PARENT_MAX   16     // 1回のScanExで発見可能な最大親機台数
#define WM_SCAN_OTHER_ELEMENT_MAX 16   // 通知可能なotherElementの最大数

/*---------------------------------------------------------------------------*
    構造体定義
 *---------------------------------------------------------------------------*/

// バッファ構造体 =======================================================================

// データセット構造体
typedef struct WMDataSet
{
//    u16 seqNum;                 // データセットのシーケンシャルナンバー
    u16     aidBitmap;
    u16     receivedBitmap;            // 受信状態のビットマップ
    u16     data[WM_DS_DATA_SIZE / sizeof(u16)];        // 共有データ

}
WMDataSet;

// DataSharing 情報構造体
typedef struct WMDataSharingInfo
{
    WMDataSet ds[WM_DS_DATASET_NUM];
    u16     seqNum[WM_DS_DATASET_NUM]; // Sequential Number
    u16     writeIndex;                // 次に書き込みを行う Index
    u16     sendIndex;                 // 現在送信中の Index
    u16     readIndex;                 // 次に読み出される Index
    u16     aidBitmap;                 // データ共有の仲間の bitmap（自分含む）
    u16     dataLength;                // 1台辺りの共有データ量
    u16     stationNumber;             // データ共有に参加している台数 (aidBitmap の立っているビットの数)
    u16     dataSetLength;             // dataLength * stationNumber
    u16     port;                      // 使用している port (8番以上)
    u16     doubleMode;                // 毎フレーム送受信可能な交互通信モードかどうか
    u16     currentSeqNum;             // 直前に読み出した DataSet の SeqNum
    u16     state;                     // 現在の DataSharing の状態(WMDataSharingState)
    u16     reserved[1];               // for 32Byte Alignment
}
WMDataSharingInfo;

// キーセット構造体
typedef struct WMKeySet
{
    u16     seqNum;                    // キーセットのシーケンシャルナンバー
    u16     rsv;
    u16     key[16];                   // キーデータ

}
WMKeySet, WMkeySet;

// キーセット保存用リングバッファ
typedef WMDataSharingInfo WMKeySetBuf, WMkeySetBuf;

//---------------------------------------
// 親子共通 MP port 送信キュー構造体
typedef struct
{
    u16     next;
    u16     port;
    u16     destBitmap;
    u16     restBitmap;
    u16     sentBitmap;
    u16     sendingBitmap;
    u16     padding;
    u16     size;
    u16     seqNo;
    u16     retryCount;
    const u16 *data;
    WMCallbackFunc callback;
    void   *arg;
}
WMPortSendQueueData;

typedef struct
{
    u16     head;
    u16     tail;
}
WMPortSendQueue;

//---------------------------------------
// 子機 MP受信バッファ構造体
typedef struct WMMpRecvBuf
{
    u16     rsv1[3];
    u16     length;

    u16     rsv2[1];
    u16     ackTimeStamp;
    u16     timeStamp;
    u16     rate_rssi;
    u16     rsv3[2];

    u16     rsv4[2];
    u8      destAdrs[6];
    u8      srcAdrs[6];
    u16     rsv5[3];
    u16     seqCtrl;

    u16     txop;
    u16     bitmap;
    u16     wmHeader;
    u16     data[2];

}
WMMpRecvBuf, WMmpRecvBuf;

//---------------------------------------
// 親機 MP受信バッファ構造体
typedef struct WMMpRecvData
{
    u16     length;
    u16     rate_rssi;
    u16     aid;
    u16     noResponse;
    u16     wmHeader;
    u16     cdata[1];

}
WMMpRecvData, WMmpRecvData;

typedef struct WMMpRecvHeader
{
    u16     bitmap;
#if SDK_VERSION_WL >= 20500
    u16     errBitmap;
#endif
    u16     count;
    u16     length;
    u16     txCount;
    WMMpRecvData data[1];

}
WMMpRecvHeader, WMmpRecvHeader;

//---------------------------------------
// 子機 DCF受信バッファ構造体
typedef struct WMDcfRecvBuf
{
    u16     frameID;
    u16     rsv1[2];
    u16     length;

    u16     rsv2[3];
    u16     rate_rssi;
    u16     rsv3[4];
    u8      destAdrs[6];
    u8      srcAdrs[6];
    u16     rsv4[4];

    u16     data[2];

}
WMDcfRecvBuf, WMdcfRecvBuf;

//---------------------------------------
// WM 親機パラメータ構造体
typedef struct WMParentParam
{
    u16    *userGameInfo;              // ユーザー領域にセットするデータのポインタ
    u16     userGameInfoLength;        // ユーザー領域の長さ
    u16     padding;

    u32     ggid;
    u16     tgid;                      // テンポラリのGameID(ユーザーが毎回親機になるときに生成する)
    u16     entryFlag;                 // 1:接続可, 0:接続不可
    u16     maxEntry;                  // 接続可能子機台数
    u16     multiBootFlag;             // 1:マルチブート可, 0:マルチブート不可
    u16     KS_Flag;                   // 1:KeySharingあり, 0:KeySharing無し
    u16     CS_Flag;                   // 1:連続送信, 0:1フレーム毎の送信
    u16     beaconPeriod;              // Beacon間隔(ms)
    u16     rsv1[WM_SIZE_USERNAME / sizeof(u16)];       //
    u16     rsv2[WM_SIZE_GAMENAME / sizeof(u16)];       //
    u16     channel;                   // チャンネル
    u16     parentMaxSize;             // 親機最大送信サイズ
    u16     childMaxSize;              // 子機最大送信サイズ

    u16     rsv[4];                    // 32バイトアライメントのため

}
WMParentParam, WMpparam;

//---------------------------------------
// WM GameInfo構造体

typedef struct WMGameInfo
{
    u16     magicNumber;               // == 0x0001
    u8      ver;                       // GameInfo Version 1
    u8      platform;                  // DS: 0, Wii: 8
    u32     ggid;
    u16     tgid;
    u8      userGameInfoLength;        // ユーザー領域の長さ
    union
    {
        // (CS_Flag):1, (KS_Flag):1, multibootFlag:1, entryFlag:1
        u8      gameNameCount_attribute;        // 互換のための旧名
        u8      attribute;
    };
    u16     parentMaxSize;             //親機最大送信サイズ
    u16     childMaxSize;              //子機最大送信サイズ
    union
    {
        u16     userGameInfo[WM_SIZE_USER_GAMEINFO / sizeof(u16)];      // ユーザー領域(最大112バイト (暫定))
        struct
        {
            u16     userName[WM_SIZE_USERNAME / sizeof(u16)];   // WM_SIZE_USERNAME -> 8
            u16     gameName[WM_SIZE_GAMENAME / sizeof(u16)];   // WM_SIZE_GAMENAME -> 16
            u16     padd1[44];         // pad -> 88 
        }
        old_type;                      // 計 112バイト
    };
}
WMGameInfo, WMgameInfo;

//---------------------------------------
// BSSDescription 親機情報構造体(Scanで獲得し、Connectでの指定に使用する)
#if SDK_VERSION_WL < 17100
typedef struct WMBssDesc
{
    u16     length;                    // 2
    u16     rssi;                      // 4
    u8      bssid[WM_SIZE_BSSID];      // 10
    u16     ssidLength;                // 12
    u8      ssid[WM_SIZE_SSID];        // 44
    u16     capaInfo;                  // 46
    struct
    {
        u16     basic;                 // 48
        u16     support;               // 50
    }
    rateSet;
    u16     beaconPeriod;              // 52
    u16     dtimPeriod;                // 54
    u16     channel;                   // 56
    u16     cfpPeriod;                 // 58
    u16     cfpMaxDuration;            // 60
    u16     gameInfoLength;            // 62
    WMGameInfo gameInfo;               // 190
    u16     rsv;                       // 192

}
WMBssDesc, WMbssDesc;
#else
typedef struct WMBssDesc
{
    u16     length;                    // 2
    u16     rssi;                      // 4
    u8      bssid[WM_SIZE_BSSID];      // 10
    u16     ssidLength;                // 12
    u8      ssid[WM_SIZE_SSID];        // 44
    u16     capaInfo;                  // 46
    struct
    {
        u16     basic;                 // 48
        u16     support;               // 50
    }
    rateSet;
    u16     beaconPeriod;              // 52
    u16     dtimPeriod;                // 54
    u16     channel;                   // 56
    u16     cfpPeriod;                 // 58
    u16     cfpMaxDuration;            // 60
    u16     gameInfoLength;            // 62
    u16     otherElementCount;         // 64
    WMGameInfo gameInfo;               // 192

}
WMBssDesc, WMbssDesc;
#endif

//---------------------------------------
// WM ビーコン内拡張エレメント構造体
typedef struct WMOtherElements
{
    u8      count;
    u8      rsv[3];
    struct
    {
        u8      id;
        u8      length;
        u8      rsv[2];
        u8     *body;
    }
    element[WM_SCAN_OTHER_ELEMENT_MAX];
}
WMOtherElements;

//---------------------------------------
// WM Scanパラメータ構造体
typedef struct WMScanParam
{
    WMBssDesc *scanBuf;                // 親機情報を格納するためのバッファ
    u16     channel;                   // Scanを行うchannel
    u16     maxChannelTime;            // 最大Scan時間
    u8      bssid[WM_SIZE_BSSID];      // Scan対象親機MacAddress(0xffなら全親機対象)
    u16     rsv[9];

}
WMScanParam, WMscanParam;

//---------------------------------------
// WM ScanExパラメータ構造体
typedef struct WMScanExParam
{
    WMBssDesc *scanBuf;                // 親機情報を格納するためのバッファ
    u16     scanBufSize;               // scanBufのサイズ
