//==============================================================================
/**
 * @file	fldeff_gym04eff.h
 * @brief	草ジムエフェクト
 * @author	kagaya
 * @data	05.07.13
 */
//==============================================================================
#ifndef FLDEFF_GYM04EFF_H_FILE
#define FLDEFF_GYM04EFF_H_FILE

#include "eoa.h"
#include "fieldobj.h"
#include "field_effect.h"

//==============================================================================
//	define
//==============================================================================
//--------------------------------------------------------------
///	噴水種類
//--------------------------------------------------------------
enum
{
	GYM04EFF_FUNSUI_LEFT = 0,
	GYM04EFF_FUNSUI_RIGHT,
	GYM04EFF_FUNSUI_ALL,
};

//==============================================================================
//	typedef
//==============================================================================

//==============================================================================
//	外部参照
//==============================================================================
extern void * FE_Gym04Eff_Init( FE_SYS *fes );
extern void FE_Gym04Eff_Delete( void *work );

extern void FE_FldOBJGym04EffSet( FIELDSYS_WORK *fsys, int type );
extern void FE_FldOBJGym04EffEndSet( FIELDSYS_WORK *fsys, int type );

#endif //FLDEFF_GYM04EFF_H_FILE
