//=============================================================================
/**
 * @file	profileboy.h
 * @brief	プロフィール登録少年イベント処理
 * @author	nohara
 * @date	08.02.28
 *
 * msgboy.cを元にしています
 */
//=============================================================================
#ifndef __PROFILEBOY_H__
#define __PROFILEBOY_H__

#include "field/field.h"

//------------------------------------------------------------------
/**
 * イベント開始
 *
 * @param   event
 *
 */
//------------------------------------------------------------------
extern void PROFILEBOY_EventStart( GMEVENT_CONTROL* event, u16* ret_wk );


#endif


