//============================================================================================
/**
 * @file	scr_factory.h
 * @bfief	スクリプトコマンド：バトルファクトリー
 * @author	Satoshi Nohara
 * @date	07.09.18
 */
//============================================================================================
#ifndef SCR_FACTORY_H
#define SCR_FACTORY_H


//============================================================================================
//
//	プログラムでのみ参照する定義
//
//============================================================================================
//__ASM_NO_DEF_が定義されている場合、アセンブラソースなので以下は無効にする
#ifndef	__ASM_NO_DEF_
extern BOOL EvCmdFactorySetContinueNG( VM_MACHINE * core );
#endif	/* __ASM_NO_DEF_ */


#endif	/* SCR_FACTORY_H */


