//==============================================================================
/**
 * @file	ending_id.h
 * @brief	キャラID、セルID等の定義場所
 * @author	matsuda
 * @date	2008.04.10(木)
 */
//==============================================================================
#ifndef __ENDING_ID_H__
#define __ENDING_ID_H__


//==============================================================================
//	キャラID
//==============================================================================
enum{
	CHARID_ENDING_START = 10000,

	CHARID_HERO,					//主人公
	CHARID_STAR,					//流れ星
	
	//-- サブ画面 --//
	CHARID_SUB_FUWANTE,					//フワンテ
	CHARID_SUB_KYAMOME,					//キャモメ
	CHARID_SUB_JIBA,					//ジバコイル
};

//==============================================================================
//	パレットID
//==============================================================================
enum{
	PLTTID_ENDING_START = 10000,

	PLTTID_HERO,					//主人公
	PLTTID_STAR,					//流れ星
	
	//-- サブ画面 --//
	PLTTID_SUB_FUWANTE,					//フワンテ
	PLTTID_SUB_KYAMOME,					//キャモメ
	PLTTID_SUB_JIBA,					//ジバコイル
};

//--------------------------------------------------------------
//	常駐OBJパレットオフセット
//--------------------------------------------------------------
enum{
	PALOFS_STAR = 3,			///<流れ星
	
//	ENDING_COMMON_PAL_NUM = 3,	///<常駐OBJパレットの本数
};

//--------------------------------------------------------------
//	サブ画面の常駐OBJパレットオフセット
//--------------------------------------------------------------
enum{
	PALOFS_SUB_FUWANTE = 1,			///<フワンテ
	PALOFS_SUB_KYAMOME = 0,			///<キャモメ
	PALOFS_SUB_JIBA = 2,			///<ジバコイル
	PALOFS_SUB_STAR = 3,			///<流れ星
	
//	ENDING_SUB_COMMON_PAL_NUM = 1,	///<サブ画面の常駐OBJパレットの本数
};

//==============================================================================
//	セルID
//==============================================================================
enum{
	CELLID_ENDING_START = 10000,

	CELLID_HERO,					//主人公
	CELLID_STAR,					//流れ星
	
	//-- サブ画面 --//
	CELLID_SUB_FUWANTE,					//フワンテ
	CELLID_SUB_KYAMOME,					//キャモメ
	CELLID_SUB_JIBA,					//ジバコイル
};

//==============================================================================
//	セルアニメID
//==============================================================================
enum{
	CELLANMID_ENDING_START = 10000,

	CELLANMID_HERO,					//主人公
	CELLANMID_STAR,					//流れ星
	
	//-- サブ画面 --//
	CELLANMID_SUB_FUWANTE,					//フワンテ
	CELLANMID_SUB_KYAMOME,					//キャモメ
	CELLANMID_SUB_JIBA,					//ジバコイル
};

//==============================================================================
//	マルチセルID
//==============================================================================
enum{
	MCELLID_ENDING_START = 10000,
};

//==============================================================================
//	マルチセルアニメID
//==============================================================================
enum{
	MCELLANMID_ENDING_START = 10000,
};



#endif	//__ENDING_ID_H__
