//==============================================================================
/**
 * @file		msg_d05r0119.h
 * @brief		メッセージID参照用ヘッダファイル
 *
 * このファイルはコンバータにより自動生成されています
 */
//==============================================================================
#ifndef __MSG_D05R0119_H__
#define __MSG_D05R0119_H__

#define	msg_d05r0119_palkia_01		(0)
#define	msg_d05r0119_palkia_02		(1)
#define	msg_d05r0119_break2_01		(2)
#define	msg_d05r0119_sppoke6_01		(3)
#define	msg_d05r0119_sppoke6_02		(4)

#endif
