//==============================================================================
/**
 * @file		msg_r216r0101.h
 * @brief		メッセージID参照用ヘッダファイル
 *
 * このファイルはコンバータにより自動生成されています
 */
//==============================================================================
#ifndef __MSG_R216R0101_H__
#define __MSG_R216R0101_H__

#define	msg_r216r0101_mount_01		(0)
#define	msg_r216r0101_mount_02		(1)
#define	msg_r216r0101_mount_03		(2)
#define	msg_r216r0101_girl4_01		(3)
#define	msg_r216r0101_bed_01		(4)
#define	msg_r216r0101_bed_02		(5)
#define	msg_r216r0101_bed_03		(6)

#endif
