//==============================================================================
/**
 * @file		msg_t07r0301.h
 * @brief		メッセージID参照用ヘッダファイル
 *
 * このファイルはコンバータにより自動生成されています
 */
//==============================================================================
#ifndef __MSG_T07R0301_H__
#define __MSG_T07R0301_H__

#define	msg_t07r0301_bigman_01		(0)
#define	msg_t07r0301_bigman_02		(1)
#define	msg_t07r0301_oldman2_01		(2)
#define	msg_t07r0301_babyboy1_01		(3)
#define	msg_t07r0301_babyboy1_02		(4)

#endif
