//==============================================================================
/**
 * @file		msg_d05r0118.h
 * @brief		メッセージID参照用ヘッダファイル
 *
 * このファイルはコンバータにより自動生成されています
 */
//==============================================================================
#ifndef __MSG_D05R0118_H__
#define __MSG_D05R0118_H__

#define	msg_d05r0118_diaiga_01		(0)
#define	msg_d05r0118_diaiga_02		(1)
#define	msg_d05r0118_break1_01		(2)
#define	msg_d05r0118_sppoke6_01		(3)
#define	msg_d05r0118_sppoke6_02		(4)

#endif
