//==============================================================================
/**
 * @file		msg_d07r0105.h
 * @brief		メッセージID参照用ヘッダファイル
 *
 * このファイルはコンバータにより自動生成されています
 */
//==============================================================================
#ifndef __MSG_D07R0105_H__
#define __MSG_D07R0105_H__

#define	msg_d07r0105_mount_01		(0)
#define	msg_d07r0105_mount_02		(1)
#define	msg_d07r0105_mount_03		(2)
#define	msg_d07r0105_mount_04		(3)
#define	msg_d07r0105_mount_05		(4)
#define	msg_d07r0105_mount_06		(5)

#endif
