//==============================================================================
/**
 * @file		msg_c04r0701.h
 * @brief		メッセージID参照用ヘッダファイル
 *
 * このファイルはコンバータにより自動生成されています
 */
//==============================================================================
#ifndef __MSG_C04R0701_H__
#define __MSG_C04R0701_H__

#define	msg_c04r0701_oldman1_01		(0)
#define	msg_c04r0701_oldwoman1_01		(1)
#define	msg_c04r0701_man1_01		(2)
#define	msg_c04r0701_man1_02		(3)
#define	msg_c04r0701_man1_03		(4)
#define	msg_c04r0701_man1_04		(5)

#endif
