//==============================================================================
/**
 * @file		msg_d17r0104.h
 * @brief		メッセージID参照用ヘッダファイル
 *
 * このファイルはコンバータにより自動生成されています
 */
//==============================================================================
#ifndef __MSG_D17R0104_H__
#define __MSG_D17R0104_H__

#define	msg_d17r0104_sppoke10_01		(0)
#define	msg_d17r0104_sppoke10_02		(1)
#define	msg_d17r0104_sppoke10_03		(2)
#define	msg_d17r0104_sppoke10_04		(3)
#define	msg_d17r0104_record_01		(4)

#endif
