//[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[
/**
 *
 *	@file		wbr_client_local.h
 *	@brief		クライアントシステム関連ソース限定ヘッダ
 *	@author		tomoya takahashi
 *	@data		2007.02.22
 *
 */
//]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]
#ifndef __WBR_CLIENT_LOCAL_H__
#define __WBR_CLIENT_LOCAL_H__

#include "wbr_common.h"
#include "field/field.h"

#undef GLOBAL
#ifdef	__WBR_CLIENT_LOCAL_H_GLOBAL
#define	GLOBAL	/* */
#else
#define	GLOBAL	extern
#endif

//-----------------------------------------------------------------------------
/**
 *					定数宣言
*/
//-----------------------------------------------------------------------------

//-----------------------------------------------------------------------------
/**
 *					構造体宣言
*/
//-----------------------------------------------------------------------------
//-------------------------------------
///	クライアント通信基本データ
//	サブぷろっくにも渡される
//=====================================
typedef struct {
	u16 netid;
	u16	next_seq;	// 次何するか(WALKプロックのみに有効)
	u16 link_netid;	// 何かをする対象のプレイヤー

	u32 heapID;
	const WBR_MYSTATUS* cp_mystatus;
	FIELDSYS_WORK* p_fsys;

	// プロックデータワーク
	void* p_procw;

	// 受信データワーク
	WBR_COMM_COMMON	comm_data[ WBR_COMM_NUM ];

} WBR_CLIENT_COMMON;

//-----------------------------------------------------------------------------
/**
 *					プロトタイプ宣言
*/
//-----------------------------------------------------------------------------
#undef	GLOBAL
#endif		// __WBR_CLIENT_LOCAL_H__

