//============================================================================================
/**
 * @file	pst_sub.h
 * @brief	ポケモンステータス画面　下画面のボタン処理
 * @author	Hiroyuki Nakamura
 * @date	2006.03.03
 */
//============================================================================================
#ifndef PST_SUB_H
#define PST_SUB_H
#undef GLOBAL
#ifdef PST_SUB_H_GLOBAL
#define GLOBAL	/*	*/
#else
#define GLOBAL	extern
#endif


//============================================================================================
//	プロトタイプ宣言
//============================================================================================

//--------------------------------------------------------------------------------------------
/**
 * 下画面ボタン設定
 *
 * @param	wk		ステータス画面のワーク
 *
 * @return	none
 */
//--------------------------------------------------------------------------------------------
GLOBAL void PokeStatus_SubButtonMake( PST_WORK * wk );

//--------------------------------------------------------------------------------------------
/**
 * ボタンBG初期化
 *
 * @param	wk		ステータス画面のワーク
 *
 * @return	none
 */
//--------------------------------------------------------------------------------------------
GLOBAL void PokeStatus_SubButtonBgInit( PST_WORK * wk );

//--------------------------------------------------------------------------------------------
/**
 * 押されたボタン取得
 *
 * @param	wk		ステータス画面のワーク
 *
 * @retval	"0xff = 押されていない"
 * @retval	"0xff != 押したボタン番号"
 */
//--------------------------------------------------------------------------------------------
GLOBAL u8 PokeStatus_SubBottonPageGet( PST_WORK * wk );

//--------------------------------------------------------------------------------------------
/**
 * ボタンアニメ
 *
 * @param	wk		ステータス画面のワーク
 *
 * @retval	"TRUE = アニメ終了"
 * @retval	"FALSE = アニメ中"
 */
//--------------------------------------------------------------------------------------------
GLOBAL u8 PokeStatus_SubButtonAnm( PST_WORK * wk );

//--------------------------------------------------------------------------------------------
/**
 * ボタンの座標取得
 *
 * @param	wk		ステータス画面のワーク
 * @param	x		X座標格納場所
 * @param	y		Y座標格納場所
 *
 * @return	none
 */
//--------------------------------------------------------------------------------------------
GLOBAL void PokeStatus_ButtonPosGet( PST_WORK * wk, s16 * x, s16 * y );

//--------------------------------------------------------------------------------------------
/**
 * ボタンのページ取得
 *
 * @param	wk		ステータス画面のワーク
 * @param	pos		ボタンID
 *
 * @retval	ページ番号
 */
//--------------------------------------------------------------------------------------------
GLOBAL u8 PokeStatus_ButtonPosPageGet( PST_WORK * wk, u8 pos );


#undef GLOBAL
#endif	/* PST_SUB_H */
