//============================================================================================
/**
 * @file	pst_bmp.h
 * @brief	ポケモンステータス画面BMP
 * @author	Hiroyuki Nakamura
 * @date	2005.11.15
 */
//============================================================================================
#ifndef PST_BMP_H
#define PST_BMP_H
#undef GLOBAL
#ifdef PST_BMP_H_GLOBAL
#define GLOBAL	/*	*/
#else
#define GLOBAL	extern
#endif


//============================================================================================
//	定数定義
//============================================================================================
#define	PST_MSG_PRMNONE	( 0xfe )	// メッセージID：「なにも　かわらなかった！」
#define	PST_MSG_EATNONE	( 0xff )	// メッセージID：「もう　これいじょう　たべない　みたい」


//============================================================================================
//	プロトタイプ宣言
//============================================================================================

GLOBAL void PokeStatusBmpAdd( PST_WORK * wk );				// 削除されました
GLOBAL void PokeStatusBmpExit( PST_WORK * wk );				// 削除されました
GLOBAL void PokeStatusTitlePut( PST_WORK * wk );			// 削除されました
GLOBAL void PokeStatusNamePut( PST_WORK * wk );				// 削除されました
GLOBAL void PokeStatusLvPut( PST_WORK * wk );				// 削除されました
GLOBAL void PokeStatusItemPut( PST_WORK * wk );				// 削除されました
GLOBAL void PokeStatusTagParamMsgPut( PST_WORK * wk );		// 削除されました
GLOBAL void PokeStatusInfoParamPut( PST_WORK * wk );		// 削除されました
GLOBAL void PokeStatusPageMemoPut( PST_WORK * wk );			// 削除されました
GLOBAL void PokeStatusPageParamPut( PST_WORK * wk );		// 削除されました
GLOBAL void PokeStatusPageConditionPut( PST_WORK * wk );	// 削除されました
GLOBAL void PokeStatusPageSkillPut( PST_WORK * wk );		// 削除されました

//--------------------------------------------------------------------------------------------
/**
 * 技情報表示
 *
 * @param	wk		ステータス画面ワーク
 * @param	waza	技番号
 *
 * @return	none
 */
//--------------------------------------------------------------------------------------------
GLOBAL void PokeStatus_WazaInfoPut( PST_WORK * wk, u32 waza );

//--------------------------------------------------------------------------------------------
/**
 * 技情報非表示
 *
 * @param	wk		ステータス画面ワーク
 *
 * @return	none
 */
//--------------------------------------------------------------------------------------------
GLOBAL void PokeStatus_WazaInfoOff( PST_WORK * wk );

//--------------------------------------------------------------------------------------------
/**
 * コンテスト技情報表示
 *
 * @param	wk		ステータス画面ワーク
 * @param	waza	技番号
 *
 * @return	none
 */
//--------------------------------------------------------------------------------------------
GLOBAL void PokeStatus_ContestWazaInfoPut( PST_WORK * wk, u32 waza );

//--------------------------------------------------------------------------------------------
/**
 * コンテスト技情報非表示
 *
 * @param	wk		ステータス画面ワーク
 *
 * @return	none
 */
//--------------------------------------------------------------------------------------------
GLOBAL void PokeStatus_ContestWazaInfoOff( PST_WORK * wk );

GLOBAL void PokeStatusPageReturnPut( PST_WORK * wk );			// 削除されました

//--------------------------------------------------------------------------------------------
/**
 * 技の５つ目の項目表示
 *
 * @param	wk		ステータス画面ワーク
 *
 * @return	none
 */
//--------------------------------------------------------------------------------------------
GLOBAL void PokeStatus_SkillCancelPut( PST_WORK * wk );

//--------------------------------------------------------------------------------------------
/**
 * 技の５つ目の項目非表示
 *
 * @param	wk		ステータス画面ワーク
 *
 * @return	none
 */
//--------------------------------------------------------------------------------------------
GLOBAL void PokeStatus_SkillCancelDel( PST_WORK * wk );

//--------------------------------------------------------------------------------------------
/**
 * 入れ替えた技を再表示
 *
 * @param	wk		ステータス画面ワーク
 *
 * @return	none
 */
//--------------------------------------------------------------------------------------------
GLOBAL void PokeStatus_SkillChgRewrite( PST_WORK * wk );

//--------------------------------------------------------------------------------------------
/**
 * 技覚えエラーメッセージ表示
 *
 * @param	wk		ステータス画面ワーク
 *
 * @return	none
 */
//--------------------------------------------------------------------------------------------
GLOBAL void PokeStatus_WazaOboeErrorMsgPut( PST_WORK * wk );

//--------------------------------------------------------------------------------------------
/**
 * ガイドメッセージ表示
 *
 * @param	wk		ステータス画面ワーク
 * @param	midx	メッセージインデックス
 *
 * @return	none
 */
//--------------------------------------------------------------------------------------------
GLOBAL void PokeStatus_GuideStrPut( PST_WORK * wk, u32 midx );

//--------------------------------------------------------------------------------------------
/**
 * ニックネーム・性別表示
 *
 * @param	wk		ステータス画面ワーク
 *
 * @return	none
 */
//--------------------------------------------------------------------------------------------
GLOBAL void PokeStatus_NickNamePut( PST_WORK * wk );

//--------------------------------------------------------------------------------------------
/**
 * レベル表示
 *
 * @param	wk		ステータス画面ワーク
 *
 * @return	none
 */
//--------------------------------------------------------------------------------------------
GLOBAL void PokeStatus_LvPut( PST_WORK * wk );

//--------------------------------------------------------------------------------------------
/**
 * アイテム表示
 *
 * @param	wk		ステータス画面ワーク
 *
 * @return	none
 */
//--------------------------------------------------------------------------------------------
GLOBAL void PokeStatus_ItemPut( PST_WORK * wk );

//--------------------------------------------------------------------------------------------
/**
 * 全ページ共通のBMP追加
 *
 * @param	wk		ステータス画面ワーク
 *
 * @return	none
 */
//--------------------------------------------------------------------------------------------
GLOBAL void PokeStatus_DefaultBmpAdd( PST_WORK * wk );

//--------------------------------------------------------------------------------------------
/**
 * ページごとのBMP追加
 *
 * @param	wk		ステータス画面ワーク
 *
 * @return	none
 */
//--------------------------------------------------------------------------------------------
GLOBAL void PokeStatus_PageBmpAdd( PST_WORK * wk );

//--------------------------------------------------------------------------------------------
/**
 * ページごとのBMP削除
 *
 * @param	wk		ステータス画面ワーク
 *
 * @return	none
 */
//--------------------------------------------------------------------------------------------
GLOBAL void PokeStatus_PageBmpFree( PST_WORK * wk );

//--------------------------------------------------------------------------------------------
/**
 * 全BMP削除
 *
 * @param	wk		ステータス画面ワーク
 *
 * @return	none
 */
//--------------------------------------------------------------------------------------------
GLOBAL void PokeStatus_BmpFreeAll( PST_WORK * wk );

//--------------------------------------------------------------------------------------------
/**
 * ページごとのBMP表示
 *
 * @param	wk		ステータス画面ワーク
 *
 * @return	none
 */
//--------------------------------------------------------------------------------------------
GLOBAL void PokeStatus_PageBmpPut( PST_WORK * wk );

//--------------------------------------------------------------------------------------------
/**
 * リボン数表示
 *
 * @param	wk		ステータス画面ワーク
 *
 * @return	none
 */
//--------------------------------------------------------------------------------------------
GLOBAL void PokeStatus_RibbonPosNumPut( PST_WORK * wk );

//--------------------------------------------------------------------------------------------
/**
 * リボン情報
 *
 * @param	wk		ステータス画面ワーク
 *
 * @return	none
 */
//--------------------------------------------------------------------------------------------
GLOBAL void PokeStatus_RibbonInfoPut( PST_WORK * wk );

//--------------------------------------------------------------------------------------------
/**
 * コンディションアップメッセージ表示
 *
 * @param	wk		ステータス画面ワーク
 * @param	num		アップしたコンディション
 *
 * @return	none
 */
//--------------------------------------------------------------------------------------------
GLOBAL void PokeStatus_CondUpMsgPut( PST_WORK * wk, u8 num );


#undef GLOBAL
#endif	/* PST_BMP_H */
