//==============================================================================
/**
 * @file	frontier_act_pri.h
 * @brief	フロンティア 2Dマップ用アクタープライオリティ定義場所
 * @author	matsuda
 * @date	2007.05.30(水)
 */
//==============================================================================
#ifndef __FRONTIER_ACT_PRI_H__
#define __FRONTIER_ACT_PRI_H__


//==============================================================================
//	BGプライオリティ
//==============================================================================
///テストアクター
#define ACT_BGPRI_TEST			(1)


//==============================================================================
//	ソフトプライオリティ
//==============================================================================
///テストアクター
#define ACT_SOFTPRI_TEST			(100)
#define ACT_SOFTPRI_ROULETTE_POKE	(200)
#define ACT_SOFTPRI_ROULETTE_ITEM	(300)


#endif	//__FRONTIER_ACT_PRI_H__
