//==============================================================================
/**
 * @file	frontier_objmove.h
 * @brief	OBJ動作コードの実動作のヘッダ
 * @author	matsuda
 * @date	2007.07.30(月)
 */
//==============================================================================
#ifndef __FRONTIER_OBJMOVE_H__
#define __FRONTIER_OBJMOVE_H__


//==============================================================================
//	定数定義
//==============================================================================
///OBJ動作コードのIDテーブル
///		※FssObjMoveFuncTblと並びを同じにしておくこと！
enum{
	OBJMOVE_ID_NULL,	///<動作コードなし
	OBJMOVE_KYORO,		///<きょろきょろ
};


//==============================================================================
//	外部関数宣言
//==============================================================================
extern void FSS_ObjMoveFuncIDSet(
	FMAIN_PTR fmain, u16 playid, u8 move_id, s16 work[], int work_num);
extern void FSS_ObjMoveFuncAll(FMAIN_PTR fmain);


#endif	//__FRONTIER_OBJMOVE_H__
