#=========================================================================================
=begin

	07.06.07 Satoshi Nohara

	stage_poke.xlsからバトルステージのポケモンテーブルを作成

	関連ファイル
		stage_poke.txt
		stage_poke.h
		stage_poke.dat		ポケモンタイプ
		stage_poke2.dat		ポケモンナンバー

=end
#=========================================================================================


#-----------------------------------------------------------------------------------------
=begin

	変数

=end
#-----------------------------------------------------------------------------------------
$poketype_buf = {}									#ハッシュ
$pokeno_buf = {}									#ハッシュ
$count = 0


##########################################################################################
#
#	ポケモンタイプ
#
##########################################################################################

#-----------------------------------------------------------------------------------------
=begin

	ハッシュ作成

=end
#-----------------------------------------------------------------------------------------
def poketype_buf_make( file )

	while text = file.gets do						#ファイルを１行ずつ読み込む

		text.chomp!									#改行がある場合のみ削る(破壊的)
		ary = text.split(/\s+/)						#自分自身を空白文字で分解する

		if( ary[0] =~ /#define/ )

			#print ary[1], "\n"						#NORMAL_TYPE(値)
			#print ary[3], "\n"						#ノーマル(キー)

			$poketype_buf[ ary[3] ] = ary[1]
		end

	end
end

#-----------------------------------------------------------------------------------------
=begin

	stage_poke.datに書き込み

=end
#-----------------------------------------------------------------------------------------
def stage_poketype_write( file, io )

	key = "エスパ－"

	while text = file.gets do						#ファイルを１行ずつ読み込む
		text.chomp!									#改行がある場合のみ削る(破壊的)
		ary = text.split(/\s+/)						#自分自身を空白文字で分解する

		if( ary[1] == nil )
			next
		end

		#ランクが含まれていたら
		if( ary[5] =~ /ランク/ )

			#エスパー　この名前だけハイフンになっているので特殊処理
			if( (ary[3] =~ /ユクシ/) ||
				(ary[3] =~ /エムリット/) ||
				(ary[3] =~ /アグノム/) )

				io.print "\n"
				io.print "\t{ SP_TYPE,\tSP_TYPE"
				io.print " },\t\t//", ary[1]
			else####################################################
				io.print "\n"
				io.print "\t{ ", $poketype_buf[ ary[6] ], ",\t"
	
				#１つのタイプしかもっていないものは、
				#２つとも同じものが入っているので、
				#このチェックはいらないが一応、、、
				if( ary[7] != nil )
					io.print $poketype_buf[ ary[7] ]
				end

				io.print " },\t\t//", ary[1]
			end
		end

	end
end


##########################################################################################
#
#	ポケモンナンバー
#
##########################################################################################

#-----------------------------------------------------------------------------------------
=begin

	ポケモンナンバー定義のハッシュ作成

=end
#-----------------------------------------------------------------------------------------
def pokeno_buf_make( file2 )

	while text = file2.gets do						#ファイルを１行ずつ読み込む

		text.chomp!									#改行がある場合のみ削る(破壊的)
		ary = text.split(/\s+/)						#自分自身を空白文字で分解する

		if( ary[1] =~ /MONSNO/ )

			#print ary[1], "\n"						#NORMAL_TYPE(値)
			#print ary[2], "\n"						#ノーマル(キー)

			$pokeno_buf[ ary[2] ] = ary[1]
		end

	end
end

#-----------------------------------------------------------------------------------------
=begin

	stage_poke2.datに書き込み

=end
#-----------------------------------------------------------------------------------------
def stage_pokeno_write( file, io )

	key = "("

	while text = file.gets do						#ファイルを１行ずつ読み込む
		text.chomp!									#改行がある場合のみ削る(破壊的)
		ary = text.split(/\s+/)						#自分自身を空白文字で分解する

		key = "("

		#ランクが含まれていたら
		if( ary[5] =~ /ランク/ )

			key += ary[2]
			key += ")"

			#print key, "\n"
			io.print "\t", $pokeno_buf[ key ], ",\t\t\/\/", ary[1], "\n"
		end

	end
end


#-----------------------------------------------------------------------------------------
=begin

	メインの流れ

=end
#-----------------------------------------------------------------------------------------
#file = open( "../../include/battle/battle_common.h" )	#技のタイプ定義ファイル読み込み
file = open( "stage_poke.h" )						#技のタイプ定義ファイル読み込み
poketype_buf_make( file )							#poketype_buf作成
file.close

file2 = open( "../../include/poketool/monsno.h" )	#ポケモン定義ファイル読み込み
pokeno_buf_make( file2 )							#pokeno_buf作成
file2.close

io = open( "stage_poke.dat", "w" )					#出力ファイル
file = open( ARGV[0] )								#stage_poke.txt
stage_poketype_write( file, io )					#stage_poke.datに書き込み
file.close
io.close											#出力ファイル閉じる

io = open( "stage_poke2.dat", "w" )					#出力ファイル
file = open( ARGV[0] )								#stage_poke.txt
stage_pokeno_write( file, io )						#stage_poke2.datに書き込み
file.close
io.close											#出力ファイル閉じる


