#=========================================================================================
=begin

	07.06.06 Satoshi Nohara

	バトルステージの書類を少し整理して、トレーナーテーブルを大体作成

	stage.xlsからstage.txtを作成して、stage_tr.datに出力
	trtype_def.hのコメントを使用しているので、それとは違う書き方を
	されているものは、うまくコンバート出来ません

=end
#=========================================================================================


#-----------------------------------------------------------------------------------------
=begin

	変数

=end
#-----------------------------------------------------------------------------------------
$trtype_buf = {}									#ハッシュ
$key


#-----------------------------------------------------------------------------------------
=begin

	ハッシュ作成

=end
#-----------------------------------------------------------------------------------------
def trtype_buf_make( file )

	key = "test"

	while text = file.gets do						#ファイルを１行ずつ読み込む

		text.chomp!									#改行がある場合のみ削る(破壊的)
		ary = text.split(/\s+/)						#自分自身を空白文字で分解する
		ary2 = text.split(/\/\//)					#自分自身を//文字で分解する

		if( ary[0] =~ /#define/ )

			#print ary[1], "\n"						#TRTYPE_TANPAN(値)
			#print ary2[1], "\n"						#たんぱんこぞう(キー)
			#print ary[3], "\n"						#たんぱんこぞう(キー)
			#print "***********", ary2[1], "\n"

			#sub,splitがここで使えないのでary2を使用

			#エラーチェック用のブレイク位置
			#if( ary[1] =~ /TANPAN/ )
			#	return
			#end

			#$trtype_buf[ ary[3] ] = ary[1]
			$trtype_buf[ ary2[1] ] = ary[1]
		end

	end
end


#-----------------------------------------------------------------------------------------
=begin

	stage_tr.datに書き込み

=end
#-----------------------------------------------------------------------------------------
def stage_trtype_write( file, io )
	while text = file.gets do						#ファイルを１行ずつ読み込む
		text.chomp!									#改行がある場合のみ削る(破壊的)
		ary = text.split(/\s+/)						#自分自身を空白文字で分解する

		if( ary[1] == nil )
			next
		end

		#for( i=1; i < 8 ;i++ )
		i = 1
		while 1

			if( ary[i] == nil )
				io.print "\n"
				break
			end

			#print "i = ", i, " チェックする単位 = ", ary[i], "   trtype_buf = ", $trtype_buf[ ary[i] ], "\n"

			io.print $trtype_buf[ ary[i] ], ",\t"
			i+=1
		end

	end
end


#-----------------------------------------------------------------------------------------
=begin

	メインの流れ

=end
#-----------------------------------------------------------------------------------------
file = open( "../../include/battle/trtype_def.h" )	#トレーナータイプ定義ファイル読み込み
trtype_buf_make( file )								#trtype_buf作成
file.close

io = open( "stage_tr.dat", "w" )					#出力ファイル
file = open( ARGV[0] )								#stage.txt
stage_trtype_write( file, io )						#stage_tr.datに書き込み
file.close

io.close											#出力ファイル閉じる


