//==============================================================================================
/**
 * @file	stage_bmp.h
 * @brief	「バトルステージ」BMP
 * @author	Satoshi Nohara
 * @date	08.06.08
 */
//==============================================================================================
#ifndef _STAGE_BMP_H_
#define _STAGE_BMP_H_

#include "stage_sys.h"
#include "system/window.h"


//==============================================================================================
//
//	定義
//
//==============================================================================================
//ビットマップID
enum{
	BMPWIN_TALK = 0,
	BMPWIN_YESNO,
	BMPWIN_POKE1,
	BMPWIN_TYPE,
	STAGE_BMPWIN_MAX,				//BMPウィンドウの数
};


//==============================================================================================
//
//	extern宣言
//
//==============================================================================================

//--------------------------------------------------------------
/**
 * @brief	ビットマップ追加
 *
 * @param	ini		BGLデータ
 * @param	win		ビットマップウィンドウ
 *
 * @return	none
 */
//--------------------------------------------------------------
extern void StageAddBmpWin( GF_BGL_INI* bgl, GF_BGL_BMPWIN* win );

//--------------------------------------------------------------
/**
 * @brief	ビットマップウィンドウ破棄	
 *
 * @param	win		ビットマップウィンドウ
 *
 * @return	none
 */
//--------------------------------------------------------------
extern void StageExitBmpWin( GF_BGL_BMPWIN* win );

//--------------------------------------------------------------
/**
 * @brief	ビットマップウィンドウオフ
 *
 * @param	win		ビットマップウィンドウ
 *
 * @return	none
 */
//--------------------------------------------------------------
extern void StageOffBmpWin( GF_BGL_BMPWIN* win );

//--------------------------------------------------------------
/**
 * @brief	メニューウィンドウ表示
 *
 * @param	ini		BGLデータ
 * @param	win		ビットマップウィンドウ
 *
 * @return	none
 */
//--------------------------------------------------------------
extern void StageWriteMenuWin( GF_BGL_INI* bgl, GF_BGL_BMPWIN* win );

//--------------------------------------------------------------------------------------------
/**
 * 会話ウィンドウ表示
 *
 * @param	win		BMPデータ
 * @param	wintype	ウィンドウタイプ
 *
 * @return	none
 */
//--------------------------------------------------------------------------------------------
extern void StageTalkWinPut( GF_BGL_BMPWIN * win, WINTYPE wintype );


#endif //_STAGE_BMP_H_


